## 데이터 병합/연결/조인

- 여러 개의Series/DataFrame 객체에 데이터들을 합치는 방법.
-

(1) 모듈 로딩
<hr>

In [3]:
import pandas as pd

(2) 데이터 준비<hr>

In [4]:
datas = {'Name' : ['홍 길동', '이 나영', '마 징가', '베 토벤'], 
         'age': [10, 21, 73, 89],
         'reg_date' : ['2000/01/13', '2020/11/05', '1999/04/13', '1997/12/21']}

datas2 = [['홍 길동', '이 나영', '마 징가', '베 토벤'], 
         [10, 21, 73, 89],
         ['2000/01/13', '2020/11/05', '1999/04/13', '1997/12/21']]

(3) 데이터 저장<hr>

In [5]:
#Dict->DataFrame
df1=pd.DataFrame(datas)
df1

   Name  age    reg_date
0  홍 길동   10  2000/01/13
1  이 나영   21  2020/11/05
2  마 징가   73  1999/04/13
3  베 토벤   89  1997/12/21

In [6]:
#List->DataFrame
df2 = pd.DataFrame(datas2)
df2

            0           1           2           3
0        홍 길동        이 나영        마 징가        베 토벤
1          10          21          73          89
2  2000/01/13  2020/11/05  1999/04/13  1997/12/21

(4) 데이터 정보 확인

In [7]:
#데이터의 전체 기본정보: info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      object
 2   2       3 non-null      object
 3   3       3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

(5) 데이터 전처리<hr>
- 5-1. 행<->열 치환

In [8]:
#df1.T
df2 = df2.transpose()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       4 non-null      object
 2   2       4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

- 5-2. 실제 데이터와 타입 확인 후 형변환하기

In [9]:
df2.head()

      0   1           2
0  홍 길동  10  2000/01/13
1  이 나영  21  2020/11/05
2  마 징가  73  1999/04/13
3  베 토벤  89  1997/12/21

In [10]:
# 1번 컬럼 : object => 정수
df2[1] = df2[1].astype('uint8') # uint ----> 부호가 붙어있지 않은 숫자. # 64면 8바이트

In [11]:
df1.dtypes

Name        object
age          int64
reg_date    object
dtype: object

In [12]:
#2번 컬럼: object->datetime64[ns]
df2[2]=df2[2].astype('datetime64[ns]')
df1.dtypes

Name        object
age          int64
reg_date    object
dtype: object

- 5-3: 0번 컬럼의 이름을 성, 이름으로 분리하기

In [13]:
#0번 컬럼 추출하기: Series
nameSR = df2[0]
#nameSR,nameSR[1]

In [14]:
#' 이 나영 ' 데이터 추출-> 성/이름으로 분리하기
#nameSR[1].split() #str

In [15]:
# for idx in range(nameSR.shape[0]):
#     nameSR[idx] = nameSR[idx].split()

In [16]:
namesDF = nameSR.str.split(expand=True)

In [17]:
df1,namesDF

(   Name  age    reg_date
 0  홍 길동   10  2000/01/13
 1  이 나영   21  2020/11/05
 2  마 징가   73  1999/04/13
 3  베 토벤   89  1997/12/21,
    0   1
 0  홍  길동
 1  이  나영
 2  마  징가
 3  베  토벤)

- 5-4. 두 개의 데이터프레임을 컬럼 방향으로 연결하기

In [18]:
pd.concat([df1, namesDF], axis ='columns', ignore_index = True )

      0   1           2  3   4
0  홍 길동  10  2000/01/13  홍  길동
1  이 나영  21  2020/11/05  이  나영
2  마 징가  73  1999/04/13  마  징가
3  베 토벤  89  1997/12/21  베  토벤

- 5-5. 두 개의 데이터프레임을 행(row)방향 데이터 연결하기

In [19]:
#여러 개의 DF, SR 연결시 모든 컬럼명/행 인덱스를 연결시키는 방식: outer
pd.concat([df2,namesDF])

      0   1          2
0  홍 길동  10 2000-01-13
1  이 나영  21 2020-11-05
2  마 징가  73 1999-04-13
3  베 토벤  89 1997-12-21
0     홍  길동        NaT
1     이  나영        NaT
2     마  징가        NaT
3     베  토벤        NaT

In [20]:
#여러 개의 DF, SR 연결시 동일 컬럼명/행 인덱스만 연결시키는 방식: inner
pd.concat([df2,namesDF],join = 'inner')

      0   1
0  홍 길동  10
1  이 나영  21
2  마 징가  73
3  베 토벤  89
0     홍  길동
1     이  나영
2     마  징가
3     베  토벤

In [21]:
f1 = pd.read_excel('../DATA/stock price.xlsx')
f2 = pd.read_excel('../Data/stock valuation.xlsx')

- merge

In [ ]:
pd.merge